---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuit.GetPointInside
source: html/e9d7c5d6-f791-a338-5ada-0f65e5ac9dd5.htm
---
# Autodesk.Revit.DB.PlanCircuit.GetPointInside Method

Returns a point inside the circuit.

## Syntax (C#)
```csharp
public UV GetPointInside()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when a valid UV point couldn't be obtained.